create_clock -period 83.333 -name pclk -waveform {0.000 41.667} [get_ports pclk]
set_input_delay -clock [get_clocks pclk] -min -add_delay 2.000 [get_ports {error[*]}]
set_input_delay -clock [get_clocks pclk] -max -add_delay 3.000 [get_ports {error[*]}]
set_input_delay -clock [get_clocks pclk] -min -add_delay 2.000 [get_ports {idx[*]}]
set_input_delay -clock [get_clocks pclk] -max -add_delay 3.000 [get_ports {idx[*]}]
set_input_delay -clock [get_clocks pclk] -min -add_delay 2.000 [get_ports en]
set_input_delay -clock [get_clocks pclk] -max -add_delay 3.000 [get_ports en]
set_input_delay -clock [get_clocks pclk] -min -add_delay 2.000 [get_ports valid_data]
set_input_delay -clock [get_clocks pclk] -max -add_delay 3.000 [get_ports valid_data]
set_output_delay -clock [get_clocks pclk] -min -add_delay 0.000 [get_ports {B[*]}]
set_output_delay -clock [get_clocks pclk] -max -add_delay 1.100 [get_ports {B[*]}]
set_output_delay -clock [get_clocks pclk] -min -add_delay 0.000 [get_ports {C[*]}]
set_output_delay -clock [get_clocks pclk] -max -add_delay 1.100 [get_ports {C[*]}]
set_output_delay -clock [get_clocks pclk] -min -add_delay 0.000 [get_ports {N[*]}]
set_output_delay -clock [get_clocks pclk] -max -add_delay 1.100 [get_ports {N[*]}]
set_output_delay -clock [get_clocks pclk] -min -add_delay 0.000 [get_ports {k[*]}]
set_output_delay -clock [get_clocks pclk] -max -add_delay 1.100 [get_ports {k[*]}]
